{
  "intents": [
    {
      "tag": "personality_traits",
      "patterns": [
        "Parle-moi des traits de personnalité des signes du zodiaque.",
        "Décris la personnalité des signes du zodiaque.",
        "Comment les signes du zodiaque diffèrent-ils en termes de personnalité?"
      ],
      "responses": [
        "Chaque signe du zodiaque a des traits de personnalité uniques. Par exemple, les Gémeaux sont connus pour leur adaptabilité et leur curiosité.",
        "Les signes du zodiaque représentent des caractéristiques différentes. Le Cancer est sensible et émotionnel, tandis que le Lion est confiant et charismatique."
      ],
      "subtags": [
        {
          "tag": "Gémeaux",
          "patterns": [
            "Comment sont les gémeaux?",
            "Décris la personnalité des gémeaux."
          ],
          "responses": [
            "Le gémeau est curieux et flexible, apprécie la compagnie des autres et déteste la monotonie."
          ]
        },
        {
          "tag": "Cancer",
          "patterns": [
            "What's Cancer like?",
            "Describe Cancer's personality."
          ],
          "responses": [
            "Cancer is sensitive and emotional, deeply attached to family and friends."
          ]
        },
        {
          "tag": "Lion",
          "patterns": [
            "Comment sont les Lions?",
            "Décris la personnalité des Lions."
          ],
          "responses": [
            "Le Lion est confiant et charismatique, attirant souvent l'attention en société."
          ]
        },
        {
          "tag": "Vierge",
          "patterns": [
            "Comment sont les Vierges?",
            "Décris la personnalité des Vierges."
          ],
          "responses": [
            "La Vierge est pratique et méticuleuse, avec un grand sens de l'ordre et de l'efficacité."
          ]
        }
      ]
    },
    {
      "tag": "travail",
      "patterns": [
        "Donne-moi des conseils de carrière.",
        "Quels types de métiers conviennent aux signes du zodiaque?",
        "Parle-moi des carrières pour les signes du zodiaque."
      ],
      "responses": [
        "Chaque signe du zodiaque a des forces uniques pour différentes carrières. Le Lion est un leader naturel, tandis que la Vierge est méthodique et précise.",
        "Les signes du zodiaque ont des traits spécifiques qui peuvent guider les choix de carrière. Par exemple, le Sagittaire s'épanouit dans des rôles aventureux."
      ],
      "subtags": [
        {
          "tag": "Lion",
          "patterns": [
            "Quelle est une bonne carrière pour le Lion?",
            "Suggestions de métiers pour le Lion?"
          ],
          "responses": [
            "Le Lion excelle dans les rôles nécessitant du leadership et de la confiance."
          ]
        },
        {
          "tag": "Vierge",
          "patterns": [
            "Quelle est une bonne carrière pour la Vierge?",
            "Suggestions de métiers pour la Vierge?"
          ],
          "responses": [
            "La Vierge est idéale pour les carrières nécessitant précision et organisation."
          ]
        },
        {
          "tag": "Scorpion",
          "patterns": [
            "Quelle est une bonne carrière pour le Scorpion?",
            "Suggestions de métiers pour le Scorpion?"
          ],
          "responses": [
            "Le Scorpion s'épanouit dans des carrières nécessitant intensité et concentration, comme l'investigation ou la recherche."
          ]
        }
      ]
    },
    {
      "tag": "horoscope_quotidien",
      "patterns": [
        "Quel est l'horoscope d'aujourd'hui?",
        "Peux-tu me donner les prédictions quotidiennes?",
        "Parle-moi des prédictions du zodiaque pour aujourd'hui."
      ],
      "responses": [
        "L'horoscope d'aujourd'hui varie pour chaque signe. Le Sagittaire peut s'attendre à de nouvelles opportunités, tandis que le Capricorne devrait se concentrer sur ses objectifs à long terme.",
        "Les horoscopes quotidiens offrent des aperçus de votre journée en fonction de votre signe du zodiaque. Les Poissons pourraient trouver la journée émotionnellement enrichissante."
      ],
      "subtags": [
        {
          "tag": "Sagittaire",
          "patterns": [
            "Quel est l'horoscope d'aujourd'hui pour le Sagittaire?",
            "Prédictions quotidiennes pour le Sagittaire?"
          ],
          "responses": [
            "Le Sagittaire peut s'attendre à une journée aventureuse avec de nouvelles opportunités."
          ]
        },
        {
          "tag": "Capricorne",
          "patterns": [
            "Quel est l'horoscope d'aujourd'hui pour le Capricorne?",
            "Prédictions quotidiennes pour le Capricorne?"
          ],
          "responses": [
            "Le Capricorne devrait se concentrer sur ses objectifs à long terme et sa discipline aujourd'hui."
          ]
        },
        {
          "tag": "Verseau",
          "patterns": [
            "Quel est l'horoscope d'aujourd'hui pour le Verseau?",
            "Prédictions quotidiennes pour le Verseau?"
          ],
          "responses": [
            "Le Verseau peut ressentir une poussée de créativité, idéale pour de nouveaux projets."
          ]
        },
        {
          "tag": "Poissons",
          "patterns": [
            "Quel est l'horoscope d'aujourd'hui pour les Poissons?",
            "Prédictions quotidiennes pour les Poissons?"
          ],
          "responses": [
            "Les Poissons pourraient trouver la journée émotionnellement enrichissante et propice à la réflexion."
          ]
        }
      ]
    },
    {
      "tag": "fallback",
      "patterns": [
        "Je ne comprends pas",
        "Peux-tu clarifier?",
        "Que veux-tu dire?",
        "Je suis confus",
        "Peux-tu expliquer?"
      ],
      "responses": [
        "Je ne suis pas sûr de comprendre. Pourriez-vous clarifier votre question?",
        "Je n'ai pas compris. Pourriez-vous être plus précis?",
        "Je suis désolé, pouvez-vous reformuler votre question?",
        "Je suis là pour aider. Pourriez-vous poser votre question différemment?"
      ]
    }
  ]
}